[
  {
    "path": "posts/2021-06-20-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Wang Xiyu",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\nContents\r\n1.0 Critique of Visualization\r\n1.1 Clarity\r\n1.2 Aesthetic\r\n2.0 Alternative Design\r\n3.0 Proposed Visualization\r\n4.0 Step-by-step Guide\r\n5.0 Derived Insights\r\n1.0 Critique of Visualization\r\nThe original visualization can be seen below.\r\n1.1 Clarity\r\nThere is no title. Readers cannot know the time range of the data, nor can they know why these ten markets are selected as representatives.\r\nIn the picture, a label is provided for each country’s point, only showing a value, but does not indicate that the value represents the total import and export value of the market.\r\nThere is no labeling unit on the horizontal and vertical axes, and the placement of the variable names of the axes is easy to confuse the reader.\r\n1.2 Aesthetic\r\nThe image background color setting is not necessary, which can easily distract readers. Also, the background colors of net importer and net exporter are too similar, which makes it difficult for readers to notice and distinguish the characteristics of which country at the first glance.\r\nThe position of the label corresponding to each circle is chaotic. The label of some circles will block the center white point of other circles. For the circles near the boundary point, it is difficult to determine which area their center point lies in.\r\nThe transparency of the dots is too low, which is a big problem for areas with dense dots. For example, the dots in Japan have almost completely covered the dots in Korea.\r\nThe content of Note is not conspicuous and redundant.\r\n2.0 Alternative Design\r\nThis figure corrects the problems in the original figure, such as the problem of ambiguous titles, labels, and variable units. This figure removes the overall background color and the background colors of net importer and net exporter, and retains the diversified colors assigned to different countries for distinction. In addition, it omits the note below the original image and simplifies the marked icon, using the tooltip instead to provide more detailed content.\r\n* Chart 1 is the Motion Chart of Top 10 Trade Volume Market, which provides detailed data of each market at various time points, including import volume, export volume, total trade volume and ranking. Besides, it can also show users the dynamic growth orbit of each country from 2011 to 2020.\r\n* Chart 2 is the Interactive Bubble Plot of Top 10 Trade Volume Market, which shows the overall trade volume of each market within the time range of 2011 to 2020 by connecting the line chart of sheet 3. Users can obtain the line chart of the import and export volume of the market during the decade by placing the mouse on the dot.\r\n3.0 Proposed Visualization\r\nPlease view the interactive visualization on Tableau Public here.\r\n4.0 Step-by-step Guide\r\n\r\nImport the metadata table, drag the new union of the left panel to the top of the main panel, and then drag the T1 and T2 on the left panel to the dialog window as shown in the picture.\r\nThe imported results (corresponding to the left and right sides of the table respectively) are shown in the figure. Next, we will deal with the leftmost column and the two rightmost columns of the table.\r\nFirst, right-click the header of the first column, and select split, then two new columns will appear as shown.\r\nBy observing column “Variables-Split 2”, we find that the majority of the markets use thousand, and only a few use million as a unit. At the same time, it is shown that the corresponding data of the market using million are all null values, so we can ignore this problem, which does not affect our subsequent operations. Then, rename the column “Variables-Split 1” as “Market”, and hide the other two columns.\r\nAs for the two rightmost columns of the table, create calculated field named “Indicator”, so that we can get a new column to help us distinguish the indicators of import and export.\r\nThen hide column “Sheet” and “Table Name”.\r\nSelect all months’ data, right-click the header of any one of the columns, select pivot.\r\nRename these two new columns as “Date” and “Trade Volume” and change their datatype into Date and Number.\r\nNow we can move to Sheet 1. First, we use create calculated filed function to derive two new variables “Import” and “Export” using the formula shown above. Now, two more variables appear in the left panel. Going back to the Data Source interface, we also find that there are two new columns at the end of the table.\r\nDrag “Export” to Columns and drag “Import” to Rows. Now only one point is shown on the screen.\r\nDrag “Market” to Detail, now each point represents a market.\r\nDrag “Date” to Filter panel, and Filter Filed dialog window appear, then select “Range of Date”. Set the range from 2011-01-01 to 2020-12-31.\r\nNow we want to add a reference line to distinguish the net importer and net exporter, using create calculated filed function, makes the “Reference Line” equals to “Export”.\r\nDrag “Reference Line” to the righthand side axis, right-click the axis and select Synchronise Axis and Show Header.\r\nChange Automatic to Line at the dropdown list of SUM(Reference Line) sub-panel, then right-click one of the point on the line and choose Trend Lines — Show Trend Lines.\r\nWe have made the reference line, but there are many points on it, which greatly affect the cleanliness of the picture. To solve this problem, we can change the transparency to 0, and we can also change the line to a more suitable color.\r\nAdding “Reference Line” to Filter enables us to eliminate the null values.\r\nCreate calculated field “Total Trade Volume”, which means the total trade volume of a specific market within a certain period.\r\nAdd “Market” to filter, exclude the Total Merchandise data and choose the Top 10 Market by “Total Trade Volume”.\r\nChange Automatic to Circle, drag Market to Size and set an appropriate size. lower the transparency.\r\nCreate calculated field “Label” to identify whether the specific market is a net importer or a net exporter.\r\nCreate calculate field “Ranking by Net Importer” and “Ranking by Net Exporter”.\r\nDrag these three new derived variables to Tooltip. Press the triangle symbol behind “Ranking by Net Importer” and select Edit Table Calculation. Change compute using to Specific Dimensions and tick the box of Market.\r\nDrag “Market” to Colour and Edit Tooltip as shown above. Now it enables the users get detailed information about the market while placing the mouse on any point.\r\nDrag “YEAR(Date)” to Page panel, click Format—Animations, turn Workbook Default on and set the Duration to 0.5 seconds. Show the filter and rename the title of the chart.\r\nDuplicate sheet 1 and remove “YEAR(Date)” from Page pane, now we can move to sheet 3 to create a line chart.\r\nDrag “Date” to Columns and drag ”Export” and “Import” to Rows.\r\nRight-click the right-hand side axis and click Synchronise Axis and Show Header. Rename the left-hand side axis to “Trade Volume”.\r\nDrag “Market” and “Date” to Filter pane, Apply to Worksheets—Selected Worksheets—Interactive Bubble Plot.\r\nEnter Edit Tooltip window, click Insert dropdown list and chose Line Chart under Sheets.\r\nNow when we hover the mouse on the dot, the trade volume line chart of the market in 2011-2020 will be displayed.\r\n5.0 Derived Insights\r\nFrom 2011 to 2020, China’s import and export volume has maintained a steady growth trend, and in 2013 it surpassed Malaysia to become the largest trade market. Taiwan has also maintained its upward momentum, and according to the line chart, Taiwan is very likely to have a milestone with a trade deficit in 2021. On the contrary, Indonesia keep decreasing both in import volume and export volume during the decade.\r\nIn the past ten years, Hong Kong has maintained a floating state close to the axis of abscissas, with export volume multiples greater than the import volume. Germany, Thailand, Japan, and South Korea showed similar patterns that their import volume trends are relatively stable, while the export volume fluctuates significantly.\r\nNet exporters are mostly market of developing countries, such as China, Malaysia, Thailand, and Indonesia. While net importers are mostly market of developed countries, such as the United States, Japan, and Germany.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T14:37:54+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Wang Xiyu",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\nContents\r\n1.0 Critique of Visualization\r\n1.1 Clarity\r\n1.2 Aesthetic\r\n2.0 Alternative Design\r\n3.0 Proposed Visualization\r\n4.0 Step-by-step Guide\r\n5.0 Derived Insights\r\n1.0 Critique of Visualization\r\nThe original visualization can be seen below.\r\n1.1 Clarity\r\nChart title is vague – The title “Merchandise Trade of Top Six Trading Countries” does not reflect that the chart compares the top six countries in terms of import and export.\r\nThe length of the x-axis is different. The x-axis of the Japanese chart is obviously the shortest. Also, “month period” is marked below, but there are no tick marks to reflect month. The intervals of the y-axis are inconsistent, which makes it difficult to intuitively compare the import and export trade volumes of different countries.\r\nThe unit is different. Hong Kong’s import indicator uses thousand US dollars as the unit, which is different from the million US dollars used by other indicators.\r\nThe coordinate axes on the left and right sides of the chart represent the import and export respectively, which is not concise and unnecessary. and it is easy to cause confusion for readers.\r\n1.2 Aesthetic\r\nThe title is not eye-catching enough. The font size is not different from other characters, and it is not bold.\r\nThe note “Month of period” below is redundant, because the month can be directly reflected by the interval of the abscissa.\r\nThe six charts are typeset in two rows, which makes it difficult for users to compare their values on the vertical axis.\r\n2.0 Alternative Design\r\nThe horizonal axis of the chart is the year (2019-2020), and the vertical axis is the merchandise trade volume (in thousands of U.S. dollars). The chart provides users with three options on the right-hand side panel:\r\nCountry/Region: Mainland China, Hong Kong, Taiwan, the United States, Japan, Malaysia, ALL\r\nIndicators: Import, Export, Trade deficit, ALL\r\nMonth: 1-12, ALL\r\nCategory: Import, Export, ALL\r\nThe chart uses six different colors to represent six countries/regions and uses different color saturations to distinguish three indicator variables, which enable the users to perform diversified combinations under the circumstance of the given months or a month period, such as comparing the import indicators of multiple selected countries, comparing multiple indicators of specified country. In addition, the user can also select a specific month or month range. The user can select January and December as a month range to obtain a polyline of annual changes. Users can also choose March, June, September, and December as the indicators at the end of each quarter, so that the corresponding four points will be marked on the polyline. The upper right corner of all polylines will show the growth rate or decline rate of the selected month range.\r\n3.0 Proposed Visualization\r\nPlease view the interactive visualization on Tableau Public here.\r\n4.0 Step-by-step Guide\r\nImport Data and combine two tables.\r\nRemove the redundant rows and columns. Rename table and headers.\r\nChange the data type of the trade volume into number.\r\nDrug Measure Values to the Column tab, and drug Measure Name and Country/Region to the Rows tab. Add all months with SUM function into measure values.\r\nClick view data in Tableau and export two tables of Import and Export.\r\nCombine these two tables and insert a column named Category on the right side of the combined table. Import the cleaned data into Tableau and change the data type as shown.\r\nAdd Category, YEAR(Date), MONTH(Date) to the Column tab and SUM(Trade Volume) to the Rows tab.\r\nAdd Category, YEAR(Date), MONTH(Date), Country/Region to Filter and show them in the right panel.\r\nAdd Category to the Colour option to differentiate the performance of the Export Volume and Import Volume.\r\nAdd another copy of SUM(Trade Volume) and change it to dual axis.\r\nRight click on the right Y-axis, select Synchronize Axis and deselect Show Header.\r\nChange panel from Automatic to Circle and choose an appropriate size for the mark.\r\n5.0 Derived Insights\r\nDuring these two years, Hong Kong’s exports were significantly more than imports, while Taiwan’s was the opposite.\r\nThe U.S. economy showed a trade deficit in 2019, and this situation was reversed in 2020.\r\nMainland China is the largest import and export economy in the world, and the overall trend is steadily increasing.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-04T14:17:02+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to DataViz Blog",
    "description": "Welcome to our new blog, DataViz Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Wang Xiyu",
        "url": "https://scis.smu.edu.sg/"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T11:22:10+08:00",
    "input_file": {}
  }
]
