[
  {
    "path": "posts/2021-05-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Wang Xiyu",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\nContents\r\n1.0 Critique of Visualization\r\n1.1 Clarity\r\n1.2 Aesthetic\r\n2.0 Alternative Design\r\n3.0 Proposed Visualization\r\n4.0 Step-by-step Guide\r\n5.0 Derived Insights\r\n1.0 Critique of Visualization\r\nThe original visualization can be seen below.\r\n1.1 Clarity\r\nChart title is vague – The title “Merchandise Trade of Top Six Trading Countries” does not reflect that the chart compares the top six countries in terms of import and export.\r\nThe length of the x-axis is different. The x-axis of the Japanese chart is obviously the shortest. Also, “month period” is marked below, but there are no tick marks to reflect month. The intervals of the y-axis are inconsistent, which makes it difficult to intuitively compare the import and export trade volumes of different countries.\r\nThe unit is different. Hong Kong’s import indicator uses thousand US dollars as the unit, which is different from the million US dollars used by other indicators.\r\nThe coordinate axes on the left and right sides of the chart represent the import and export respectively, which is not concise and unnecessary. and it is easy to cause confusion for readers.\r\n1.2 Aesthetic\r\nThe title is not eye-catching enough. The font size is not different from other characters, and it is not bold.\r\nThe note “Month of period” below is redundant, because the month can be directly reflected by the interval of the abscissa.\r\nThe six charts are typeset in two rows, which makes it difficult for users to compare their values on the vertical axis.\r\n2.0 Alternative Design\r\nThe horizonal axis of the chart is the year (2019-2020), and the vertical axis is the merchandise trade volume (in thousands of U.S. dollars). The chart provides users with three options on the right-hand side panel:\r\nCountry/Region: Mainland China, Hong Kong, Taiwan, the United States, Japan, Malaysia, ALL\r\nIndicators: Import, Export, Trade deficit, ALL\r\nMonth: 1-12, ALL\r\nCategory: Import, Export, ALL\r\nThe chart uses six different colors to represent six countries/regions and uses different color saturations to distinguish three indicator variables, which enable the users to perform diversified combinations under the circumstance of the given months or a month period, such as comparing the import indicators of multiple selected countries, comparing multiple indicators of specified country. In addition, the user can also select a specific month or month range. The user can select January and December as a month range to obtain a polyline of annual changes. Users can also choose March, June, September, and December as the indicators at the end of each quarter, so that the corresponding four points will be marked on the polyline. The upper right corner of all polylines will show the growth rate or decline rate of the selected month range.\r\n3.0 Proposed Visualization\r\nPlease view the interactive visualization on Tableau Public here.\r\n4.0 Step-by-step Guide\r\nImport Data and combine two tables.\r\nRemove the redundant rows and columns. Rename table and headers.\r\nChange the data type of the trade volume into number.\r\nDrug Measure Values to the Column tab, and drug Measure Name and Country/Region to the Rows tab. Add all months with SUM function into measure values.\r\nClick view data in Tableau and export two tables of Import and Export.\r\nCombine these two tables and insert a column named Category on the right side of the combined table. Import the cleaned data into Tableau and change the data type as shown.\r\nAdd Category, YEAR(Date), MONTH(Date) to the Column tab and SUM(Trade Volume) to the Rows tab.\r\nAdd Category, YEAR(Date), MONTH(Date), Country/Region to Filter and show them in the right panel.\r\nAdd Category to the Colour option to differentiate the performance of the Export Volume and Import Volume.\r\nAdd another copy of SUM(Trade Volume) and change it to dual axis.\r\nRight click on the right Y-axis, select Synchronize Axis and deselect Show Header.\r\nChange panel from Automatic to Circle and choose an appropriate size for the mark.\r\n5.0 Derived Insights\r\nDuring these two years, Hong Kong’s exports were significantly more than imports, while Taiwan’s was the opposite.\r\nThe U.S. economy showed a trade deficit in 2019, and this situation was reversed in 2020.\r\nMainland China is the largest import and export economy in the world, and the overall trend is steadily increasing.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-04T13:15:22+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to DataViz Blog",
    "description": "Welcome to our new blog, DataViz Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Wang Xiyu",
        "url": "https://scis.smu.edu.sg/"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T23:00:54+08:00",
    "input_file": {}
  }
]
